export const data = {
  values: [
    {
      title: "Здоровʼя",
      description:
        "Ми прагнемо щоб кожен міг мати якісне та довге життя наповнене енергією",
    },
    {
      title: "Безпека",
      description:
        "Ми пояснюємо кожну вправу та стежимо за дотриманням правильної техніки",
    },
    {
      title: "Системність",
      description:
        "Бажаний результат, залежить від системного підходу та дисципліни. Завдяки цьому ми формуємо здорові звички",
    },
    {
      title: "Індивідуальність",
      description:
        "Кожна людина є особливою. І ми це враховуємо на кожному тренуванні.",
    },
    {
      title: "Культура",
      description: "Ми вважаємо, що повага має бути як до себе, так і до інших",
    },
    {
      title: "Розвиток та інноваційність",
      description:
        "Ми постійно слідкуємо за новими тенденціями, додаємо нові види занять, а тренери постійно підвищують свою кваліфікацію",
    },
  ],
  rules: [
    {
      title: "*",
      description: "Дотримуватися особистої та загальної гігієни",
    },
    {
      title: "*",
      description:
        "Ставитися з повагою до тренерів студії, та інших відвідувачів.",
    },
    {
      title: "*",
      description:
        "Використовувати змінні взуття та одяг. Одяг має бути чистим та зручним",
    },
    {
      title: "*",
      description:
        "Попередній запис обов’язковий (відбувається на сайті через вхід в особистий кабінет)",
    },
    {
      title: "*",
      description:
        "Cкасувати реєстрацію на групове заняття можна не пізніше ніж за 3 години до його початку. На ранкові тренування запис відбувається до 21 години",
    },
  ],
};
