import '../styles/home.css';

function Home() {
    return (
        <section className="home-section">
            <div className="intensity-hero">
                {/* <p>welcome to</p> */}
                <h1>INTENSITY</h1>
                <h3>Fitness & Danse Studio</h3>
                <p>A place of your health, strength and energy</p>
                <p>
                    Наша місія – покращувати якість життя, без шкоди для
                    здоров'я!
                </p>
                {/* <button>Look for details</button> */}
            </div>
            <div className="home-subsection">
                ВІДВІДУВАННЯ ЗАНЯТЬ БЕЗ АБОНЕМЕНТІВ! Персональне тренування від
                600 ₴ Групове тренування - 300 ₴
            </div>
            <div className="home-subsection">
                <h3>Наші цінності</h3>
                <div className="home-values">
                    <div>
                        <p>
                            ЗДОРОВ`Я Ми хочемо, щоб ви були здоровими, жили
                            довше і отримували задоволення від активного життя.
                        </p>
                    </div>
                    <div>
                        <p>
                            ЕНЕРГІЯ ТА ЯКІСТЬ ЖИТТЯ Ми хочемо, щоб ви були
                            здоровими, жили довше і отримували задоволення від
                            активного життя.
                        </p>
                    </div>
                    <div>
                        <p>
                            ПЕРСОНАЛІЗОВАНІСТЬ Нас об’єднує пристрасть до
                            фітнесу, але кожна людина має індивідуальні
                            особливості організму та характеру. Ми розуміємо це.
                            І враховуємо під час розробки програми тренувань і
                            вибору тренера.
                        </p>
                    </div>
                    <div>
                        <p>
                            СИСТЕМНІСТЬ Жодні починання не дають результатів без
                            системного підходу. Фітнес — це система навичок і
                            звичок. Ми робимо все, щоб надихати членів нашої
                            спільноти до такої системності.
                        </p>
                    </div>
                    <div>
                        <p>
                            СВІДОМІСТЬ Ми віримо, що свідоме ставлення робить
                            заняття суттєво ефективнішими. Відтак, ми пояснюємо
                            сутність тренувань, логіку вправ і доречність
                        </p>
                    </div>
                    <div>
                        <p>
                            КУЛЬТУРА Ми вважаємо, що кожна людина має з повагою
                            ставитись до оточуючих. Ми віримо у підтримку, у
                            надихання, у ввічливість і співчуття. Саме тому ми
                            приділяємо багато значення атмосфері у колективі.
                        </p>
                    </div>
                    <div>
                        <p>
                            ІННОВАЦІЙНІСТЬ Ми віримо у безперервний розвиток, і
                            тому у нашому розкладі постійно з’являються нові
                            види занять, у тренерів — нові знання.
                        </p>
                    </div>
                    <div>
                        <p>
                            БЕЗПЕКА Ми фанатично стежимо за тим, щоб ви
                            дотримувалися правильної техніки виконання вправ. На
                            кардіо тренуваннях ми видаємо датчики вимірювання
                            пульсу, щоб бачити, в який пульсової зоні ви
                            перебуваєте.
                        </p>
                    </div>
                    <div>
                        <p>
                            ЧАС Всі наші тренування тривають 45 хвилин. Цього
                            цілком достатньо щоб добре потренуватися і принести
                            собі користь.
                        </p>
                    </div>
                    <div>
                        <p>
                            РЕЗУЛЬТАТ Ми дуже хочемо, щоб у вас все вийшло і ви
                            досягали цілей, які перед собою ставите, а потім
                            ставили нові, більш амбітні.
                        </p>
                    </div>
                </div>
            </div>
            <div className="home-subsection">
                <h3>Засновник</h3>
                <p>
                    АНЖЕЛІКА БУЛДЕНКО Все життя в фітнесі. Перепробував дуже
                    багато – від бодібілдингу та пауерліфтингу до
                    функціонального фітнесу, TRX і бразильського джиу-джитсу. В
                    останні роки є представником американської компанії TRX,
                    єдиним в СНД майстер-тренером, сертифікованим за всіма
                    програмами навчання TRX, має вищий рівень кваліфікації TRX.
                    Накопичений багаторічний досвід мріяв реалізувати, створивши
                    ідеальну фітнес-студію, в якій тренувальні програми
                    будуються не навколо тренажерів і обладнання, а навколо
                    майстерності і кваліфікації тренера. Залишалося тільки
                    знайти однодумця, який би поділяв його ідеї…
                </p>
            </div>
        </section>
    );
}

export default Home;
