import '../styles/services.css';

// Services component
function Services() {
    const classes = [
        {
            title: 'Functional',
            description:
                "Силове тренування з використанням гантель, гумових еластичних стрічок та/або власної ваги тіла. Комплексно прокачує всі м'язи тіла, робота на рельєф.",
        },
        {
            title: 'Tabata',
            description:
                'Кардіо-силове інтенсивне тренування, в часових рамках. 20 секунд - вправи, 10 секунд - відпочинок. Для охочих схуднути та витратити більше ккал за час тренування.',
        },
        {
            title: 'ABS',
            description:
                "Силове тренування. Сукупність вправ на м'язи живота, стегон, сідниць та попереку.",
        },
        {
            title: 'Healthy Back',
            description:
                "Тренування низької інтенсивності, направлене на розвиток мобільності спини, легкого витяжіння та безпечного зміцнення м'язевого корсету. Корекційний та профілактичний напрямок тренувань.",
        },
        {
            title: 'Pilates',
            description:
                "Комплексне тренування спрямоване на розвиток та зміцнення м'язів. Включає елементи статичних положень, силових занять, розтяжки, та детальне опрацювання глибоких м'язів",
        },
        {
            title: 'Yoga',
            description:
                'Комплекс асан (поз), що поєднують помірно динамічні та статичні положення, дихальні вправи та витяжіння. Практики пробуджують, заряджають енергією та налаштовують на продуктивний день.',
        },
        {
            title: 'Stretching',
            description:
                "Напрямок по витяжінню м'язів всього тіла. Збільшують амплітуду руху, розслаблюють. Чудово підійде для компенсації силових занять.",
        },
        {
            title: 'Fly Stretching',
            description:
                "Розтяжка на гамаках. Поєднання балансових вправ, для ввімкнення глибоких м'язів, разом з класичним стретчингом",
        },
        {
            title: 'Yoga Stretching',
            description:
                'Комплекс асан з йоги, направлені на усвідомлене витяжіння мязів всього тіла, покращення рухливості. Робота з диханням.',
        },
        {
            title: 'Heels',
            description:
                'Танцювальний напрям на підборах. Для вивільнення та відкриття в собі жіночності, сексуальності та грації.',
        },
    ];
    return (
        <section className="services-section">
            <h2>Our Services</h2>
            <div className="ss-trainings">
                <div>
                    <h1>ГРУПОВІ ТРЕНУВАННЯ</h1>
                    <p>
                        Обирайте бажаний час та напрям у розкладі. 300 грн - 1
                        тренування
                    </p>
                </div>
                <div>
                    <h1>ПЕРСОНАЛЬНІ ТРЕНУВАННЯ</h1>
                    <p>
                        Заняття з персональним тренером допоможуть вам
                        максимально швидко досягти бажаних результатів. У такий
                        спосіб ви отримуєте: - Тренування згідно з вашими
                        індивідуальними особливостями - Пояснення та контроль за
                        виконанням вправ та комбінацій - Більш глибоке розуміння
                        та опанування навичок
                    </p>
                </div>
                <div>
                    <h1>ОНЛАЙН ТРЕНУВАННЯ</h1>
                    <p>групові та персональні класи</p>
                </div>
            </div>

            <div className="ss-trainings">
                <h2>Напрямки тренувань студії</h2>
                {classes.map((el, i) => (
                    <div key={i}>
                        <h1>{el.title}</h1>
                        <p>{el.description}</p>
                    </div>
                ))}
            </div>

            <div className="services-subsection">
                <div>
                    <p>
                        Всі напрямки та відповідні до них вправи сформовані у
                        відповідності з протоколами здорових тренувань. Вам
                        потрібно лише записатися на заняття у зручний час, взяти
                        з собою форму та довіритися тренеру. В чому суть? три
                        основні напрямки тренувань: силові, жироспалювальні,
                        відновлювальні; сучасні формати: 3D, TRX, HIIT, кругові,
                        інтервальні, класичні та інші; заняття чітко по
                        протоколу – без зайвих непотрібних вправ; протоколи
                        (вправи на тренуваннях) змінюються щомісяця – щоб м’язи
                        не звикали, щоб був прогрес і ніколи не набридало;
                        розклад змінюється щотижня – щоб ви потрапляли на різні
                        тренування, якщо ходите в один і той самий час; в групі
                        8 осіб, щоб тренер зміг приділити увагу кожному. Ми
                        хочемо, щоб ви тренувались якісно; тренування 50 хвилин
                        – щоб ви отримали достатнє навантаження, енергію,
                        результат, а не виснаження; професіоналізм тренера,
                        атмосфера, енергія від тренування перетворить фітнес на
                        корисну і захопливу звичку. Ви будете ходити на
                        тренування не тому, що треба, а тому що хочеться.
                    </p>
                </div>
            </div>
        </section>
    );
}

export default Services;
