import '../styles/services.css';

// Services component
function Services() {
    return (
        <section className="services-section">
            <h2>Our Services</h2>
            <div className="ss-trainings">
                <div>
                    <h1>ГРУПОВІ ТРЕНУВАННЯ</h1>
                    <p>
                        Обирайте бажаний час та напрям у розкладі. 300 грн - 1
                        тренування
                    </p>
                </div>
                <div>
                    <h1>ПЕРСОНАЛЬНІ ТРЕНУВАННЯ</h1>
                    <p>
                        Заняття з персональним тренером допоможуть вам
                        максимально швидко досягти бажаних результатів. У такий
                        спосіб ви отримуєте: - Тренування згідно з вашими
                        індивідуальними особливостями - Пояснення та контроль за
                        виконанням вправ та комбінацій - Більш глибоке розуміння
                        та опанування навичок
                    </p>
                </div>
                <div>
                    <h1>ОНЛАЙН ТРЕНУВАННЯ</h1>
                    <p>групові та персональні класи</p>
                </div>
            </div>

            <div className="services-subsection">
                <div>
                    <p>
                        В основі наших занять лежить система, яка приведе до
                        результату, на який ви розраховуєте. Всі напрямки та
                        відповідні до них вправи сформовані у відповідності з
                        протоколами здорових тренувань. Вам потрібно лише
                        записатися на заняття у зручний час, взяти з собою форму
                        та довіритися тренеру. В чому суть? три основні напрямки
                        тренувань: силові, жироспалювальні, відновлювальні;
                        сучасні формати: 3D, TRX, HIIT, кругові, інтервальні,
                        класичні та інші; заняття чітко по протоколу – без
                        зайвих непотрібних вправ; протоколи (вправи на
                        тренуваннях) змінюються щомісяця – щоб м’язи не звикали,
                        щоб був прогрес і ніколи не набридало; розклад
                        змінюється щотижня – щоб ви потрапляли на різні
                        тренування, якщо ходите в один і той самий час; в групі
                        8 осіб, щоб тренер зміг приділити увагу кожному. Ми
                        хочемо, щоб ви тренувались якісно; тренування 50 хвилин
                        – щоб ви отримали достатнє навантаження, енергію,
                        результат, а не виснаження; професіоналізм тренера,
                        атмосфера, енергія від тренування перетворить фітнес на
                        корисну і захопливу звичку. Ви будете ходити на
                        тренування не тому, що треба, а тому що хочеться.
                    </p>
                </div>
            </div>

            <div className="ss-trainings">
                <h2>Напрямки тренувань студії</h2>
                <div>
                    <h1>Functional</h1>
                    <p>
                        Силове тренування з використанням гантель, гумових
                        еластичних стрічок та/або власної ваги тіла. Комплексно
                        прокачує всі м'язи тіла, робота на рельєф.
                    </p>
                </div>
                <div>
                    <h1>Tabata</h1>
                    <p>
                        Кардіо-силове інтенчивне тренування, в часових рамках.
                        20 секунд - вправи, 10 секунд - відпочинок. Для охочих
                        схуднути та витратити більше ккал за час тренування.
                    </p>
                </div>
                <div>
                    <h1>ABS</h1>
                    <p>
                        Силове тренування. Сукупність вправ на м'язи живота,
                        стегон, сідниць та попереку
                    </p>
                </div>
                <div>
                    <h1>Healthy Back</h1>
                    <p>
                        Тренування низької інтенсивності, направлене на розвиток
                        мобільності спини, легкого витяжіння та безпечного
                        зміцнення м'язевого корсету. Корекційний та
                        профілактичний напрямок тренувань.
                    </p>
                </div>
                <div>
                    <h1>Pilates</h1>
                    <p>
                        Комплексне тренування спрямоване на розвиток та
                        зміцнення м'язів. Включає елементи статичних положень,
                        силових занять, розтяжки, та детальне опрацювання
                        глибоких м'язів
                    </p>
                </div>
                <div>
                    <h1>Yoga</h1>
                    <p>
                        Комплекс асан (поз), що поєднують помірно динамічні та
                        статичні положення, дихальні вправи та витяжіння.
                        Практики пробуджують, заряджають енергією та
                        налаштовують на продуктивний день.
                    </p>
                </div>
                <div>
                    <h1>Stretching</h1>
                    <p>
                        Напрямок по витяжінню м'язів всього тіла. Збільшують
                        амплітуду руху, розслаблюють. Чудово підійде для
                        компенсації силових занять.
                    </p>
                </div>
                <div>
                    <h1>Fly Stretching</h1>
                    <p>
                        Розтяжка на гамаках. Поєднання балансових вправ, для
                        ввімкнення глибоких м'язів, разом з класичним
                        стретчингом
                    </p>
                </div>
                <div>
                    <h1>Yoga Stretching</h1>
                    <p>
                        Комплекс асан з йоги, направлені на усвідомлене
                        витяжіння мязів всього тіла, покращення рухливості.
                        Робота з диханням.
                    </p>
                </div>
                <div>
                    <h1>Heels</h1>
                    <p>
                        Танцювальний напрям на підборах. Для вивільнення та
                        відкриття в собі жіночності, сексуальності та грації.
                    </p>
                </div>
            </div>
        </section>
    );
}

export default Services;
