import '../styles/services.css';

// Services component
function Services() {
    return (
        <section className="services-section">
            <h2>Our Services</h2>в чому особливість тренувань в hiitworks? В
            основі наших занять лежить система, яка приведе до результату, на
            який ви розраховуєте. Ми все придумали за вас – напрямки, формати,
            вправи, протоколи тренувань. Вам потрібно лише записатися на заняття
            у зручний час, взяти з собою форму та довіритися тренеру. А далі
            починається фітнес магія, від якої ви отримаєте не тільки результат,
            а й задоволення) В чому суть? три основні напрямки тренувань:
            силові, жироспалювальні, відновлювальні; сучасні формати: 3D, TRX,
            HIIT, кругові, інтервальні, класичні та інші; заняття чітко по
            протоколу – без зайвих непотрібних вправ; протоколи (вправи на
            тренуваннях) змінюються щомісяця – щоб м’язи не звикали, щоб був
            прогрес і ніколи не набридало; розклад змінюється щотижня – щоб ви
            потрапляли на різні тренування, якщо ходите в один і той самий час;
            в групі 12 осіб, щоб тренер зміг приділити увагу кожному. Ми хочемо,
            щоб ви тренувались якісно; на інтенсивних тренуваннях контроль
            пульсу за допомогою датчиків; тренування 45 хвилин – щоб ви отримали
            достатнє навантаження, енергію, результат, а не виснаження;
            професіоналізм тренера, атмосфера, енергія від тренування
            перетворить фітнес на корисну і захопливу звичку. Ви будете ходити
            на тренування не тому, що треба, а тому що хочеться) Складайте
            індивідуальний пазл для досягнення своєї цілі! Комбінуйте,
            тренуйтеся регулярно, отримуйте кайф і результат!
            <div className="services-subsection">
                <h1>ГРУПОВІ ТРЕНУВАННЯ</h1>
                <div>
                    <p>
                        Обирайте бажаний час та напрям у розкладі. 300 грн - 1
                        тренування
                    </p>
                </div>
            </div>
            <div className="services-subsection">
                <h1>ПЕРСОНАЛЬНІ ТРЕНУВАННЯ</h1>
                <div>
                    <p>
                        Заняття з персональним тренером допоможуть вам
                        максимально швидко досягти бажаних результатів в
                        спортзалі. Ми пропонуємо кілька категорій тренерів, в
                        залежності від ваших цілей і потреб.
                    </p>
                    Під час занять з персональним тренером ви отримуєте:
                    Правильну програму тренувань, складену згідно з вашими
                    індивідуальними особливостями Контроль за коректним
                    виконанням вправ Системність та ефективність тренувань
                    Мотивацію та підтримку від тренера Індивідуально розроблену
                    для вас фітнес-дієту Усвідомленість та різноманітність
                    тренувань
                </div>
            </div>
            <div className="services-subsection">
                <h1>ОНЛАЙН ТРЕНУВАННЯ</h1>
                <div>
                    <p>
                        5 тренувань зі стретчингу та шпагату від тренера BODYART
                        / FITNESS Ольги Кадацької. Тренуйтесь з нами, навіть
                        вдома!
                    </p>
                </div>
            </div>
        </section>
    );
}

export default Services;
